[{
    "_id": "2040",
    "subcode": "17AE54",
    "subname": "AIRCRAFT STRUCTURES - I",
    "m1": "Module 1",
    "m1desc": "Design for Static Strength: \nIntroduction: Normal, shear, biaxial and tri-axial stresses, Stress tensor, Principal Stresses, Stress Analysis, Design considerations, Codes and Standards. Static Strength: Static loads and factor of safety, Theories of failure: Maximum normal stress theory, Maximum shear stress theory, Maximum strain theory, Strain energy theory, and Distortion energy theory, failure of brittle and ductile materials, Stress concentration, and Determination of Stress concentration factor.",
    "m2": "Module 2",
    "m2desc": "Design for Impact and Fatigue Strength \nImpact Strength: Introduction, Impact stresses due to axial, bending and torsional loads, effect of inertia. Fatigue Strength: Introduction, S-N Diagram, Low cycle fatigue, High cycle fatigue, Endurance limit, modifying factors: size effect, surface effect, Stress concentration effects, Fluctuating stresses, Goodman and Soderberg relationship, stresses due to combined loading, cumulative fatigue damage.",
    "m3": "Module 3",
    "m3desc": "Loads on Aircraft and Aircraft Materials Loads on Aircraft:\nStructural nomenclature, Types of loads, load factor, Aerodynamics loads, Symmetric manoeuvre loads, Velocity diagram, Function of structural components. Desirable properties for aircraft application. Fracture and Fatigue, Stress Intensity Factor, Crack Growth Rate Derivation.",
    "m4": "Module 4",
    "m4desc": "Theory of Elasticity and Structures: \nTheory of Elasticity: and Theory of Elasticity: Concept of stress and strain, derivation of Equilibrium equations, strain displacement relation, compatibility conditions and boundary conditions. Plane stress and Plane strain problems in 2D elasticity. Principle Stresses and Orientation of Principle Directions.  \n\nStructures: \nStatically Determinate and Indeterminate structures, Analysis of plane truss, Method of joints, 3D Truss, Plane frames, Composite beam, Clapeyron’s Three Moment Equation.",
    "m5": "Module 5",
    "m5desc": "Energy Methods and Columns \nEnergy Methods: \nStrain Energy due to axial, bending and Torsional loads. Castigliano’s theorem, Maxwell’s Reciprocal theorem. \n\nColumns: \nColumns with various end conditions, Euler’s Column curve, Rankine’s formula, Column with initial curvature, Eccentric loading, south-well plot, Beam-column.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books:  \n1. V.B. Bhandari, ‘Design of Machine Elements’, Tata McGraw Hill Publishing Company Ltd., New   Delhi, 2nd Edition 2007. \n2. Megson, T.M.G ‘Aircraft Structures for Engineering Students’,., Edward Arnold, 1995. \n3. Timoshenko and Goodier,” ‘Theory of Elasticity’, McGraw Hill Co.\n\nReference Books:\n1. Robert L. Norton , Machine Design, , Pearson Education Asia, 2001. \n2. Donaldson, B.K., “Analysis of Aircraft Structures – An Introduction”, McGraw-Hill, 1993. \n3. Timoshenko, S., “Strength of Materials”, Vol. I and II, Princeton D Von Nostrand Co, 1990 \n4. Joseph E Shigley and Charles R.Mischke, Mechanical Engineering Design, McGraw Hill International edition, 6th Edition 2009. \n5. Peery, D.J., and Azar, J.J., “Aircraft Structures”, 2nd edition, McGraw, Hill, N.Y., 1993. \n6. Bruhn. E.H. “Analysis and Design of Flight Vehicles Structures”, Tri – state off set company, USA, 1985.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
