[{
    "_id": "2030",
    "subcode": "17AE53",
    "subname": "HEAT & MASS TRANSFER",
    "m1": "Module 1",
    "m1desc": "Fundamentals: \nDifferent modes of heat transfer and mass and momentum transfer, elements of mass diffusion and boundary layer theory. Mass  transfer definition  and  terms  used  in  mass  transfer  analysis,Fick’s  First  law  of diffusion (no numerical).",
    "m2": "Module 2",
    "m2desc": "Conduction: \nDerivation of general three dimensional conduction equation in Cartesian coordinate, special cases, discussion  on 3-D  conduction  in cylindrical  and  spherical  coordinate  systems. Effect of variation of thermal conductivity on heat transfer in solids - Heat transfer problems in infinite and semi-infinite solids - Extended surfaces.",
    "m3": "Module 3",
    "m3desc": "Convection: \nConcepts of Continuity, Momentum and Energy Equations.  Dimensional analysis-Buckingham’s Pi Theorem - Application for developing non-dimensional correlation for convective heat transfer  \n\nFree Convection: \nDevelopment of Hydrodynamic and thermal  boundary  layer  along  a  vertical  plate  ,  Use  of empirical relations for Vertical plates and pipes.  \n\nForced Convection: \nExternal Flows, Concepts of hydrodynamic and thermal boundary layer and use of empirical correlations for Flat plates and Cylinders. Internal Flows, Concepts about Hydrodynamic and Thermal Entry Lengths, use of empirical correlations for Horizontal Pipe Flow and annulus flow",
    "m4": "Module 4",
    "m4desc": "Radiation & Heat Exchangers Design: \nRadiation: Introduction to physical mechanism - Radiation properties - Radiation shape factors - Heat exchange between non-black bodies - Radiation shields \n\nHeat Exchangers: \nClassification of  heat  exchangers;  overall  heat  transfer coefficient,  fouling  and  fouling  factor;  LMTD,  Effectiveness-NTU  methods of analysis of heat exchangers. Numerical problems.",
    "m5": "Module 5",
    "m5desc": "Heat and Mass Transfer Problems in Aerospace Engineering: \nHeat transfer problems in gas turbine combustion chambers - Rocket thrust chambers - Aerodynamic heating -Ablative heat transfer.  \n\nMass Transfer: \nIntroduction, Ficks law, Species conservation equation, Introduction to convective and diffusive mass transfer.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books: \n1. Ozisik, Heat transfer-A basic approach, Tata McGraw Hill 2002 \n2. Holman, J.P.,  Heat Transfer , McGraw Hill Book Co., Inc., New York, 8th edition., 1996, ISBN-13: 978-0071143202 \n\nReference Books:  \n1. Sachdeva, S.C.,  Fundamentals of Engineering Heat and Mass Transfer , Wiley Eastern Ltd., New Delhi, 1981. \n2. Sutton, G.P., Rocket Propulsion Elements , John Wiley and Sons, 5th Edn.1986. \n3. Mathur, M.and Sharma, R.P.,  Gas Turbine and Jet and Rocket Propulsion , Standard Publishers, New Delhi 1988. \n4. P.K. Nag, Heat transfer, Tata McGraw Hill 2002 \n5.Yunus  A-  Cengel , Heat  transfer,  a  practical  approach,  Tata  McGraw Hill , 3rd edition, 2007. ",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
