[{
    "_id": "2060",
    "subcode": "17AE552",
    "subname": "GAS DYNAMICS",
    "m1": "Module 1",
    "m1desc": "Fundamental Equations of Steady Flow: \nContinuity and momentum equations, The thrust function, The dynamic equation and Euler’s Equation.Bernoulli’s Equation.Steady flow energy equation.",
    "m2": "Module 2",
    "m2desc": "Isentropic Flow: \nAcoustic velocity, Mach number, Mach cone and Mach angle.Flow parameters, stagnation temperature, pressure, and density. \n\nAdiabatic Flow: \nStagnation temperature change.Rayleigh line, Pressure ratio and temperature ratio, Entropy considerations, maximum heat transfer.\n\nFlow with Friction: \nThe fanning equation, Friction factor and friction parameter, Fanno line, Fanno equations.",
    "m3": "Module 3",
    "m3desc": "Wave Phenomena: \nClassification of wave phenomena, analysis of shock phenomena, Hugoniot equation. Weak waves, compression waves, Normal shock waves, oblique shock waves, Entropy considerations, Rayleigh Pilot equations, detonation and deflageration.",
    "m4": "Module 4",
    "m4desc": "Variable Area Flow: \nVelocity variation with Isentropic flow, Criteria for acceleration and deceleration. Effect of pressure ratio on Nozzle operation. Convergent nozzle and convergent divergent nozzle. Effect of back pressure on nozzle flow.Isothermal flow functions. Comparison of flow in nozzle. Generalized one dimensional flow.",
    "m5": "Module 5",
    "m5desc": "Applications of dimensional analysis and similitude to gas dynamic problems.\n\nIntroduction to Flames and Combustion: \nFlame propagation, diffusion flames, premixed flames, flame velocity, theories of flame propagation, ignition for combustible mixture, flame stabilization.",
    "descname": "Prescribed text books",
    "descdata": "Text Books:  \n1. Fundamentals of Compressible flow: Yahya, 2ndEdn. 1991; Wiley Eastern. \n2. Gas Dynamics, E Radhakrishnan, PHI-2006  \n\nReference Books: \n1. Introduction to Gas Dynamics: Rolty, Wiley 1998 \n2. Elements of Gas Dynamics: Liepmann and Roshko, Wiley 1994. \n3.The dynamics and thermodynamics of compressible fluid flow: Shapiro Ronold Press. 1999\n4. Modern Compressible Flow, J. D. Anderson, McGraw Hill Education, 2004.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
