[{
    "_id": "2003",
    "subcode": "17AE564",
    "subname": "BASICS OF ROCKETS & MISSILES",
    "m1": "Module 1",
    "m1desc": "Introduction: \nSpace launch Vehicles and military missiles, function, types, role, mission, mission profile, thrust profile, propulsion system, payload, staging, control and guidance requirements, performance measures, design, construction, operation, similarities and differences. Some famous space launch vehicles and strategic missiles.",
    "m2": "Module 2",
    "m2desc": "Solid Propellant Rocket Motor Systems: \nSolid Propellant rocket motors, principal features, applications. Solid propellants, types, composition, properties, performance. Propellant grain, desirable properties, grain configuration, preparation, loading, structural design of grain. Liners, insulators and inhibitors, function, requirements, materials. Rocket motor casing – materials. Nozzles, types, design, construction, thermal protection. Igniters, types, construction. Description of modern solid boosters I) Space Shuttle SRB, II) the Arienne SRB.",
    "m3": "Module 3",
    "m3desc": "Aerodynamics of Rockets and Missiles: \nClassification of missiles. Airframe components of rockets and missiles, Forces acting on a missile while passing through atmosphere, method of describing aerodynamic forces and moments, lateral aerodynamic moment, lateral damping moment, longitudinal moment of a rocket, lift and drag forces, drag estimation, body upwash and downwash in missiles. Rocket dispersion, re-entry body design considerations.",
    "m4": "Module 4",
    "m4desc": "Launch Vehicle Dynamics: \nTsiolskovsky’s rocket equation, range in the absence of gravity, vertical motion in the earth’s gravitational field, inclined motion, flight path at constant pitch angle, motion in the atmosphere, the gravity turn – the culmination altitude, multi staging. Earth launch trajectories – vertical segment, the gravity turn, constant pitch trajectory, orbital injection. Actual launch vehicle trajectories, types. Examples, the Mu 3-S-II, Ariane, Pegasus launchers. Reusable launch vehicles, future launchers, launch assist technologies.  \n\nAttitude Control of Rockets and Missiles: \nRocket Thrust Vector Control – Methods of Thrusts Vector Control for solid and liquid propulsion systems, thrust magnitude control, thrust termination; stage separation dynamics, separation techniques.",
    "m5": "Module 5",
    "m5desc": "Rocket Testing: \nGround Testing and Flight Testing, Types of Tests facilities and safeguards, monitoring and control of toxic materials, instrumentation and data management. Ground Testing, Flight Testing, Trajectory monitoring, post -accident procedures. Description of a typical space launch vehicle launch procedure. \n\nMaterials: \nCriteria for selection of materials for rockets and missiles, requirements for choice of materials for propellant tanks,  liners, insulators, inhibitors, at cryogenic temperatures, requirements of materials at extremely high temperatures, requirements of materials for thermal protection and for pressure vessels.",
    "descname": "Prescribed text books",
    "descdata": "Text Books: \n1.George P Sutton and Oscar Biblarz, ‘Rocket Propulsion Element’, John Wiley and Sons Inc,7th edition, 2010, ISBN-13: 978-8126525775. \n2.Jack N Neilson, ‘Missile Aerodynamics’, AIAA,1st edition, 1988, ISBN-13: 9780962062902.  \n\nReference Books:  \n1. SS. Chin, ‘Missile Configuration Design’, McGraw Hill, 1961. \n2. Cornelisse, J.W, Schoyer H.F.R. and Wakker, K.F., Rocket Propulsion and Space-Flight Dynamics, Pitman, 1979,ISBN-13: 978-0273011415 \n3. Turner, M.J.L., Rocket and Spacecraft propulsion, Springer,3rd edition, 2010, ISBN-13: 9783642088698. \n4. Ball, K.J., Osborne, G.F., Space Vehicle Dynamics, Oxford University Press, 1967,ISBN-13:9780198561071 \n5. Parker, E.R., Materials for Missiles and Spacecraft, McGraw Hill, 1982.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
