[{
    "_id": "2050",
    "subcode": "17AE551",
    "subname": "FUELS & COMBUSTION",
    "m1": "Module 1",
    "m1desc": "Fuel Properties: \nFuel Properties, Relative Density, API Gravity, Molecular Mass, Distillation Range,  Vapor Pressure, Flash Point, Volatility Point, Viscosity, Surface Tension, Freezing Point, Specific Heat, Latent Heat, Thermal Conductivity, Combustion Properties of Fuels, Calorific Value, Enthalpy, Spontaneous-Ignition temperature, Limits of Flammability, Smoke Point, Luminometer Number, Smoke Volatility Index, Pressure and Temperature Effects, Sub atmospheric Pressure, Low Temperature, High Temperature.",
    "m2": "Module 2",
    "m2desc": "Fuel Treatment: \nIntroduction, Types of Hydrocarbons, Paraffins, Olefins, Naphthenes, Aromatics, Production of Liquid Fuels,Removal of Sulfur Compounds, Contaminants, Asphaltenes, Gum,  Sediment, Ash, Water, Sodium, Vanadium, Additives, Gum Prevention, Corrosion Inhibition/Lubricity Improvers, Anti-Icing, Antistatic–Static Dissipators, Metal Deactivators, Antismoke.",
    "m3": "Module 3",
    "m3desc": "Alternative Fuels aerospace applications: \nHydrogen, Methane, Propane, Ammonia, Alcohols, Slurry fuels, Synthetic fuels, Fuels Produced by Fischer–Tropsch Synthesis of Coal/Biomass, Biofuels, Alternative fuel Properties, Combustion and Emissions Performance, Fischer–Tropsch Fuels, Biodiesel Fuels, Highly Aromatic (Broad Specification).",
    "m4": "Module 4",
    "m4desc": "Combustion Fundamentals: \nDeflagration, Detonation, Classification of Flames, Physics of combustion Chemistry, Flammability Limits, Global Reaction-Rate Theory, Weak Mixtures, Rich Mixtures, Laminar Premixed Flames, laminar and turbulent flame burning velocity, measurement techniques for flame velocity, Factors Influencing Laminar Flame Speed, Equivalence Ratio, Initial Temperature, Pressure, Laminar Diffusion Flames, Turbulent Premixed Flames, Flame Propagation in Heterogeneous Mixtures of Fuel Drops, Fuel Vapor and Air.\n\nCombustion flame characterization: \nDroplet and Spray Evaporation, Heat-Up Period, Evaporation Constant, Convective Effects, Effective Evaporation Constant, Spray Evaporation,  Ignition Theory, Gaseous Mixtures, Heterogeneous Mixtures, Spontaneous Ignition, Flashback, Stoichiometry,  Adiabatic Flame Temperature, Factors Influencing the Adiabatic Flame Temperature, Fuel/Air Ratio, Initial Air Temperature, Pressure. ",
    "m5": "Module 5",
    "m5desc": "Combustion Performance: \nCombustion Efficiency, The Combustion Process, Reaction-Controlled Systems, Burning Velocity Model, Stirred Reactor Model, Mixing-Controlled Systems, Evaporation-Controlled Systems, Reaction- and EvaporationControlled Systems.\n\nFlame Stabilization & Fuel Classification: \nDefinition of Stability Performance, Measurement of Stability Performance, Bluff-Body Flame holders, Stabilization, Mechanisms of Flame Stabilization, Flame Stabilization in Combustion Chambers, Classification of Liquid Fuels, Aircraft Gas Turbine Fuels, Engine Fuel System,  Aircraft Fuel Specifications, Classification of Gaseous Fuels.  ",
    "descname": "Prescribed text books",
    "descdata": "Text  Books:  \n1. Arthur H. Lefebvre & Dilip R. Ballal, Gas Turbine Combustion, CRC Press, 3rd Edition, 2010 \n2. Minkoff, G.J., and C.F.H. Tipper, Chemistry of Combustion Reaction, London Butterworths, 1962. \n3. Samir Sarkar, Fuels & Combustion, Orient Long man 1996.  \n\nReference Books:  \n1. Wilson, P.J. and J.H. Wells, Coal, Coke and Coal Chemicals, McGraw-Hill, 1960. \n2. Williams, D.A. and G. James, Liquid Fuels, London Pergamon, 1963. \n3. Gas Engineers Handbook, New York, Industrial Press, 1966.",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
