[{
    "_id": "2020",
    "subcode": "17AE52",
    "subname": "INTRODUCTION TO COMPOSITE MATERIALS",
    "m1": "Module 1",
    "m1desc": "Introduction to Composite Materials: \nDefinition, classification of composite materials, classification of reinforcement - particulate, short fiber, whiskers, long fibers composites. matrix materials – metals, ceramics, polymers (including thermoplastics and thermosets), Carbon-Carbon Composites.\n\nMetal Matrix Composites: \nMMC with particulate and short fiber reinforcement, liquid and solid state processing of MMC – stir casting, squeeze casting. Properties of MMCs, Applications of Al, Mg, Ti based MMC",
    "m2": "Module 2",
    "m2desc": "Processing of Polymer Matrix Composites: \nThermoset Polymers, Hand layup Process, Vacuum Bagging Process, Post Curing Process, Filament winding, Pultrusion, Pulforming, Autoclave .\n\nProcess Processing of Polymer Matrix Composites: \nThermoplastic Polymers, Extrusion process, Injection Moulding Process, Thermo-forming process. \n\nPost Processing of Composites :\nAdhesive bonding, drilling, cutting processes.",
    "m3": "Module 3",
    "m3desc": "Micro-Mechanical Behavior of a Lamina: \nDetermination of elastic constants Rule of mixtures, transformation of coordinates, micro-mechanics based analysis and experimental determination of material constants. \n\nMacro-Mechanical Behavior of a Lamina:  \nGlobal and local axis for angle lamina, determination of global and local stresses and moduli, for 2D-UD lamina with different fiber orientation .",
    "m4": "Module 4",
    "m4desc": "Failure Theory – \nTsai-Hill, Tsai-Wu, Max Stress and Max Strain  Classical plate theory- Stress and strain variation in a laminate- Resultant forces and moments- A B & D matrices- Strength analysis of a laminate.",
    "m5": "Module 5",
    "m5desc": "Inspection & Quality Control: \nDestructive & Non-Destructive Testing, Tensile, Compression, Flexural, Shear, Hardness; ultrasonic testing – A-B-C scan .\n\nApplications of Composites Materials: \nAutomobile, Aircrafts, missiles, Space hardware, Electrical and electronics, marine, recreational and Sports equipment, future potential of composites.",
    "descname": "Prescribed text books",
    "descdata": "Text  Books: \n1. K.K Chawla, Composite Materials- Science and Engineering, II edition, Springer Verlag, 1998: ISBN: 0-387-98409-7 \n2. Autar Kaw, Mechanics of Composites, II edition, CRC Press. 2006, ISBN:978-0-84931343-1 \n\nReference Books:  \n1. Mein Schwartz, Composite Materials Handbook, Vol.3, Department of Defense, USA, 2002. \n2. Ajay Kapadia, Non-Destructive Testing of Composite Materials, National Composites Network, Best Practices Guide, TWI Publications, 2006. \n3. R M Jones, “ Mechanics of Composite Materials”, 2ndEdn, Taylor & Francis, 2015; ISBN:978-1560327127 .",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
}]
