[{
    "_id": "0060",
    "subcode": "17AE652",
    "subname": "EXPERIMENTAL AERODYNAMICS",
    "m1": "Module 1",
    "m1desc": "Wind Energy Collectors: \nHorizontal axis and vertical axis machines. Power coefficient. Betz coefficient by momentum theory. \n\nVehicle Aerodynamics: \nPower requirements and drag coefficients of automobiles. Effects of cut back angle. Aerodynamics of Trains and Hovercraft.",
    "m2": "Module 2",
    "m2desc": "Building Aerodynamics: \nPressure distribution on low rise buildings, wind forces on buildings. Environmental winds in city blocks, Special problems of tall buildings, building codes, building ventilation and architectural aerodynamics. \n\nFlow Induced Vibrations: \nEffects of Reynolds number on wake formation of bluff shapes, Vortex induced vibrations, Galloping and stall flutter.",
    "m3": "Module 3",
    "m3desc": "Model Measurements: \nBalances: design, installation and, calibration. Internal balances. Mounting of models, rigidity. Measurement of interference. Lift and drag measurements through various techniques. Testing procedures. Testing: 3-D wings, controls, complete model, power effects, aero elasticity, dynamic stability. Testing with ground plane, testing wind mill generator. Testing for local loads. Testing of rotor. Testing engines, Jettison tests. Data reduction. Data correction.",
    "m4": "Module 4",
    "m4desc": "Wind Tunnel Boundary Corrections and Scale Effects: \nEffects of lateral boundaries. Method of images. Wall corrections. Effects of Buoyancy, Solid Blocking, Wake Blocking. General downwash correction. Lift interference correction. Corrections for reflection plane models. Scale effects on aerodynamic characteristics and stability derivatives.",
    "m5": "Module 5",
    "m5desc": "Near sonic and Transonic Testing: \nNear sonic tunnel design. Calibration of test section. Model support system. Tare and interference evaluation. Near transonic testing. \n\nSupersonic Wind Tunnel Testing: \nTypes of supersonic tunnels: - continuous, intermittent (indraft and blowdown). Pressure-vacuum tunnels. Supersonic tunnel design features. Calibration of test section. Optical systems-  Schlieren set-up. Starting loads. Hypersonic wind tunnels - General introduction .",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
    "qbscreenparams": ""
}]
