[{
    "_id": "0040",
    "subcode": "17AE64",
    "subname": "AIRCRAFT STRUCTURES - II",
    "m1": "Module 1",
    "m1desc": "Bending and shear- \nOpen and Closed Thin Walled Beams Symmetrical bending, unsymmetrical bending, direct stress distribution due to bending, position of the neutral axis, load intensity, shear force, and bending moment relationships, deflection due to bending, calculation of section properties, approximation for thin-walled sections. \n\nShear of beams:\nGeneral stress, strain, and displacement relationship for open and single-cell closed section thin-walled beams, shear of open section beams, shear centre, shear of closed section beams. Torsion of close section beam, and displacement associated with the Bredt-Batho shear flow. Torsion of open section beam.",
    "m2": "Module 2",
    "m2desc": "Combined Open and Closed Section Beams, and Structural Idealisation \nBending, shear, torsion. Structural idealisation-Principle, Idealisation of a panel, effect of idealisation on the analysis of open and closed section beams. Bending of open and closed section idealised beams, shear of open section and closed section idealised beams. Deflection of open and closed section idealised beams.",
    "m3": "Module 3",
    "m3desc": "Buckling of Plates, Joints and Fittings :\nBuckling of Isotropic flat plates in compression, ultimate compressive strength of Isotropic flat sheet, plastic buckling of flat sheet, columns subjected to local crippling failure, Needham & Gerard method for determining crippling stress, curved sheets in compression, elastic buckling of curved rectangular plates. Pure tension field beams, angle of diagonal tension in web.",
    "m4": "Module 4",
    "m4desc": "Stress Analysis in Wing Spars and Box beams: \nTapered wing spar, open and closed section beams, beams having variable stringer areas, three- boom shell, torsion and shear, tapered wings, cut-outs in wings.",
    "m5": "Module 5",
    "m5desc": "Stress Analysis in Fuselage Frames: \nBending, shear, torsion, cut-outs in fuselages, principles of stiffeners construction, fuselage frames, shear flow distribution.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
    "qbscreenparams": ""
}]
