[{
    "_id": "0070",
    "subcode": "17AE653",
    "subname": "SPACE MECHANICS",
    "m1": "Module 1",
    "m1desc": "Space Environment: \nPeculiarities of space environment and its description, effect of space environment on materials of spacecraft structure and astronauts, manned space missions, effect on satellite life time.",
    "m2": "Module 2",
    "m2desc": "Basic Concepts and the General N-Body: \nThe solar system, reference frames and coordinate systems, terminology related to the celestial sphere and its associated concepts, Kepler’s laws of planetary motion and proof of the laws, Newton’s universal law of gravitation, the many body problem, Lagrange-Jacobi identity, the circular restricted three body problem, libration points, the general N-body problem, two body problem, relations between position and time.",
    "m3": "Module 3",
    "m3desc": "Satellite Injection and Satellite Perturbations: \nGeneral aspects of satellite injection, satellite orbit transfer, various cases, orbit deviations due to injection errors, special and general perturbations, Cowell’s method and Encke’s method, method of variations of orbital elements, general perturbations approach.",
    "m4": "Module 4",
    "m4desc": "Interplanetary Trajectories: \nTwo-dimensional interplanetary trajectories, fast interplanetary trajectories, three dimensional interplanetary trajectories, launch of interplanetary spacecraft, trajectory estimation about the target planet, concept of sphere of influence, Lambert’s theorem.",
    "m5": "Module 5",
    "m5desc": "Ballistic Missile Trajectories: \nIntroduction to ballistic missile trajectories, boost phase, the ballistic phase, trajectory geometry, optimal flights , time of flight, re-entry phase, the position of impact point, influence coefficients.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
    "qbscreenparams": ""
}]
