[{
    "_id": "0007",
    "subcode": "17AE664",
    "subname": "MAINTENANCE, OVERHAUL & REPAIR OF AIRCRAFT SYSTEMS",
    "m1": "Module 1",
    "m1desc": "Fundamentals of Maintenance & Certification: \nTypes of maintenance, Redesign, Failure rate pattern, Other maintenance considerations.\n\nAviation industry certification requirements, Type certificate (FAA form 8110.9), Airworthiness certificate (FAA form 8100-2), Aviation maintenance certifications, General, Airframe, Power plant, Avionics courses.",
    "m2": "Module 2",
    "m2desc": "Documentation for Maintenance: \nManufacturers documentation, Airplane maintenance manual, Fault insulation manual, Illustrated parts catalogue, structural repair manual, wiring diagram manual, Master minimum equipment, Federal Aviation regulation (FAR), Advisory circulars, Airworthiness direction ATA document standards, Technical policies and procedure manuals (TPPM).",
    "m3": "Module 3",
    "m3desc": "Aircraft Management Maintenance: \nStructure, Role of aviation management, Line supervisory management, Management areas of concern in airlines, Manager of overhaul shops, Line maintenance control centre flight line (preflight & post flight), Aircraft Logbook, Maintenance crew skill requirements.",
    "m4": "Module 4",
    "m4desc": "Hanger Maintenance (on Aircraft) & Material Support: \nIntroduction, organization of hanger maintenance, Non- routine item, parts availability, cannibalization, Types of shops- sheet metal shop, Aircraft interior  shop, Engine shop, Avionics shop, ground support equipment, outsourcing of shop maintenance work, operation of overhaul shops, Material support, Material management inventory control, Support functions of material, Parts ordering, Storage, Issue, control and handling, Parts receiving quality control, calibration program, stock level adjustments, shelf life, exchanges, warranty & modifications of parts.",
    "m5": "Module 5",
    "m5desc": "Maintenance Safety & Trouble shooting: \nSafety regulations, occupational safety and health standards maintenance safety program, Airlines safety management, General safety rules, Accident & injury reporting, Hazardous materials storage and handling aircraft furnishing practices trouble shooting, Knowledge of malfunctions.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
    "qbscreenparams": ""
}]
