[{
    "_id": "0050",
    "subcode": "17AE651",
    "subname": "FINITE ELEMENT METHOD",
    "m1": "Module 1",
    "m1desc": "Introduction: \nBasic Concepts, Background Review: Stresses and Equilibrium, Plane stress, Plane strain, Potential energy and Equilibrium. Rayleigh - Ritz Method, Galerkin’s Method, Simple applications in structural Analysis. Construction or discrete models - sub domains and nodes - simple elements for the FEM - Simplex, complex and multiples elements Polynomial selection -illustrative examples Elements and shape functions and natural coordinates, Use of local and natural coordinates, compatibility and convergence requirements of shape functions.",
    "m2": "Module 2",
    "m2desc": "Fundamentals of Finite Element Method: \nConstruction of shape functions for bar element and beam element, Bar elements, uniform bar elements, uniform section, mechanical and thermal loading, varying section, truss analysis, Frame element, Beam element, problems for various loadings and boundary conditions.",
    "m3": "Module 3",
    "m3desc": "Analysis of Two and Three dimensional Elements: \nShape functions of Triangular, Rectangular and Quadrilateral elements, different types of higher order elements, constant and linear strain triangular elements, stiffness matrix Four-Noded Tetrahedral Element (TET 4), Eight-Noded Hexahedral Element (HEXA 8), Tetrahedral elements, Hexahedral elements: Serendipity family, Hexahedral elements: Lagrange family.",
    "m4": "Module 4",
    "m4desc": "Theory of Isoparametric Elements and Axisymmetric: \nIsoparametric, sub parametric and super-parametric elements, characteristics of Isoparametric quadrilateral elements, structure of computer program for FEM analysis, description of different modules, pre and post processing, Axisymmetric formulation finite element modeling of triangular and quadrilateral element.",
    "m5": "Module 5",
    "m5desc": "Field Problems: \nHeat transfer problems, Steady state fin problems, 1D heat conduction governing equation, Derivation of element matrices for two dimensional problems, Dynamic consideration- FormulationHamilton’s principle, Element mass matrices.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
   
