[{
    "_id": "0012",
    "subcode": "17AE61",
    "subname": "AERODYNAMICS - II",
    "m1": "Module 1",
    "m1desc": "One Dimensional Compressible Flow: \nEnergy, Momentum, continuity and  state  equations,velocity  of  sound,  Adiabatic  steady  state  flow equations, Flow through converging, diverging passages, Performance under various back pressures. Numericals.",
    "m2": "Module 2",
    "m2desc": "Normal Shock:\nPrandtl Meyer equation and Rankine – Hugonoit relation, Normal shock equations: Property ratios in terms of upstream Mach number, Numericals, Moving Normal Shock wave.",
    "m3": "Module 3",
    "m3desc": "Oblique shocks and Expansion waves: \nPrandtl  equation  and  Rankine –  Hugonoit  relation,  Normal  shock  equations,  Pitot  static  tube, corrections  for  subsonic  and  supersonic  flows,  Oblique  shocks  and  corresponding  equations, Hodograph  and  pressure  turning  angle,  shock  polars,  flow  past  wedges  and  concave  corners,  strong, weak and detached shocks, Flow past convex corners, Prandtl –Meyer expansion function, Reflection  and  interaction  of  shocks  and  expansion,  waves,  Families  of  shocks. Flow with Friction and Heat transfer.",
    "m4": "Module 4",
    "m4desc": "Differential Equations of Motion for Steady Compressible Flows:\nBasic potential equations for compressible flow. Linearisation of potential equation-small perturbation theory. Methods for solution of nonlinear potential equation –Introduction, Method of characteristics, Boundary conditions, Pressure coefficient expression, small perturbation equation for compressible flow - Prandtl, Glauret and Geothert's rules - Ackert's supersonic airfoil theory, Von-Karman rule for transonic flow, Lift, drag pitching moment and center of pressure of supersonic profiles.",
    "m5": "Module 5",
    "m5desc": "Measurements in High speed Flow: \nTypes of subsonic wind tunnels - Balances and measurements - Interference effects- transonic, Supersonic and hypersonic wind tunnels and characteristic features, their operation and performance - Shock tubes and shock tunnels - Free flight testing - Measurements of pressure, velocity and Mach number -Flow visualization methods of subsonic and supersonic flows.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
    "qbscreenparams": ""
}]
