[{
    "_id": "0013",
    "subcode": "17AE62",
    "subname": "GAS TURBINE TECHNOLOGY",
    "m1": "Module 1",
    "m1desc": "Types, Variation & Applications: \nTypes of engines showing arrangement of parts. Operating parameters. Energy distribution of turbojet, turboprop and turbofan engines. Comparison of thrust and specific fuel consumption. Thrust, pressure and velocity diagrams. \n\nEngine Parts: \nCompressor assembly, types of burners: advantages and disadvantages. Influence of design factors on burner performance. Effect of operating variables on burner performance. Performance requirements of combustion chambers. Construction of nozzles. Impulse turbine and reaction turbine. Exhaust system, sound suppression. \n\nThrust reversal:\ntypes, design & systems. Methods of thrust augmentation, after burner system.",
    "m2": "Module 2",
    "m2desc": "Materials and Manufacturing: \nCriteria for selection of materials. Heat ranges of metals, high temperature strength. Surface finishing. Powder metallurgy. Use of composites and Ceramics. Super alloys for Turbines. \n\nSystems: \nFuel systems and components. Sensors and Controls. FADEC interface with engine. Typical fuel system. Oil system components. Typical oil system. Starting systems. Typical starting characteristics. Various gas turbine starters.",
    "m3": "Module 3",
    "m3desc": "Engine Performance: \nDesign & off - design Performance. Surge margin requirements, surge margin stack up. Transient performance. Qualitative characteristics quantities. Transient working lines. Starting process & Wind milling of Engines. Thrust engine start envelope. Starting torque and speed requirements Calculations for design and offdesign performance from given test data– (case study for a single shaft Jet Engine).Engine performance monitoring.",
    "m4": "Module 4",
    "m4desc": "Compressor: \nCompressor MAP. Surge margin, Inlet distortions. Testing and Performance Evaluation. \n\nCombustor: \nCombustor MAP, Pressure loss, combustion light up test. Testing and Performance Evaluation. \n\nTurbines: \nTurbine MAP. Turbine Testing and Performance Evaluation. Inlet duct & nozzles: Ram pressure recovery of inlet duct. Propelling nozzles, after burner, maximum mass flow conditions. Testing and Performance Evaluation.",
    "m5": "Module 5",
    "m5desc": "Engine Testing: \nProof of Concepts: Design Evaluation tests. Structural Integrity. Environmental Ingestion Capability. Preliminary Flight Rating Test, Qualification Test, Acceptance Test. Reliability figure of merit. Durability and Life Assessment Tests, Reliability Tests. Engine testing with simulated inlet distortions and, surge test. Estimating engineoperating limits. Methods of displacing equilibrium lines.\n\nTypes of engine testing’s: \nNormally Aspirated Testing, Open Air Test Bed, Ram Air Testing, Altitude Testing, Altitude test facility, Flying Test Bed, Ground Testing of Engine Installed in Aircraft, Flight testing. Jet thrust measurements in flight. Measurements and Instrumentation. Data Acquisition system, Measurement of Shaft speed, Torque, Thrust, Pressure, Temperature, Vibration, Stress, Temperature of turbine blading etc. Engine performance trends: Mass and CUSUM plots. Accuracy and Uncertainty in Measurements. Uncertainty analysis. Performance Reduction Methodology.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
    "qbscreenparams": ""
}]
