[{
    "_id": "0014",
    "subcode": "17AE63",
    "subname": "AIRCRAFT PERFORMANCE",
    "m1": "Module 1",
    "m1desc": "The Equations of Motion Steady Unaccelerated Flight: \nIntroduction, four forces of flight, General equation of motion, Power available and power required curves. Thrust available and thrust required curves. Conditions for power required and thrust required minimum. Thrust available and maximum velocity, Power available and maximum velocity, Altitude effects on power available and power required; thrust available and thrust required.",
    "m2": "Module 2",
    "m2desc": "Steady Performance – Level Flight, Climb & Glide Performance: \nEquation of motion for Rate of climb- graphical and analytical approach -Absolute ceiling, Service ceiling, Time to climb – graphical and analytical approach, climb performance graph (hodograph diagram); maximum climb angle and rate of climb Gliding flight, Range during glide, minimum rate of sink and shallowest angle of glide.",
    "m3": "Module 3",
    "m3desc": "Fundamental Airplane Performance Parameters: \nThe fundamental Parameters: \nThrust – to – weight ratio, Wing loading, Drag polar, and lift-to – drag ratio. Minimum velocity. Aerodynamic relations associated with lift-to-drag ratio. \n\nRange and Endurance:  \nPropeller driven Airplane: Physical consideration, Quantitative formulation, Breguet equation for Range and Endurance, Conditions for maximum range and endurance.",
    "m4": "Module 4",
    "m4desc": "Aircraft Performance in Accelerated Flight Take-off Performance: \nCalculation of Ground roll, Calculation of distance while airborne to clear obstacle, Balanced field length .\n\nLanding Performance and Accelerated Climb: \nCalculation of approach distance, Calculation of flare distance, Calculation of ground roll, ground effects. Acceleration in climb.",
    "m5": "Module 5",
    "m5desc": "Maneuver Performance Turning performance: \nLevel turn, load factor, Constraints on load factor, Minimum turn radius, Maximum turn rate. Pull-up and Pulldown maneuvers: (Turning rate, turn radius). Limiting case for large load factor. The V-n diagram. Limitations of pull up and push over.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
    "qbscreenparams": ""
}]
