[{
    "_id": "0090",
    "subcode": "17AE661",
    "subname": "UNMANNED AERIAL VEHICLES BASICS & APPLICATIONS",
    "m1": "Module 1",
    "m1desc": "Introduction: \nAviation History and Overview of UAV systems, Classes and Missions of UAVs, Definitions and Terminology, UAV fundamentals, Examples of UAV systems-very small, small, Medium and Large UAV.",
    "m2": "Module 2",
    "m2desc": "The Air Vehicle:  \n\nBasic Aerodynamics: \nBasic Aerodynamics equations, Aircraft polar, the real wing and Airplane, Induced drag, the boundary layer, Flapping wings, Total Air-Vehicle Drag  \n\nPerformance: \nOverview, climbing flight, Range and Endurance – for propellerdriven aircraft, range- a jet-driven aircraft, Guiding Flight.",
    "m3": "Module 3",
    "m3desc": "Stability and Control Overview, \nStability, longitudinal, lateral, dynamic stability, Aerodynamics control, pitch control, lateral control, Autopilots, sensor, controller, actuator, airframe control, inner and outer loops, Flight-Control Classification, Overall Modes of Operation, Sensors Supporting the Autopilot.",
    "m4": "Module 4",
    "m4desc": "Propulsion:\nOverview, Thrust Generation, Powered Lift, Sources of Power, The Two-Cycle Engine, The Rotary Engine, The Gas Turbine, Electric Motors, Sources of Electrical Power. \n\nLoads and Structures: \nLoads, Dynamic Loads, Materials, Sandwich Construction, Skin or Reinforcing Materials, Resin Materials, Core Materials, Construction Techniques.",
    "m5": "Module 5",
    "m5desc": "Mission Planning and Control: \nAir Vehicle and Payload Control, Reconnaissance/Surveillance Payloads, Weapon Payloads, Other Payloads, Data-Link Functions and Attributes, Data-Link Margin, Data-Rate Reduction, Launch Systems, Recovery Systems, Launch and Recovery Tradeoffs.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "https://adityam945.github.io/aero-json-files/",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "https://adityam945.github.io/aero-json-files/",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "https://adityam945.github.io/aero-json-files/",
    "qbscreenparams": ""
}]
