[
  {
    "_id": "7680",
    "subcode": "17AE832",
    "subname": "BOUNDARY LAYER THEORY",
    "m1": "Module 1",
    "m1desc": "Preliminary Concepts : \nSome examples of viscous flow phenomena: - aerofoil, cylinder, circular pipe. Boundary conditions for viscous flow problems. The kinematics properties of viscous flow. \n\nFundamental Equations of Viscous Flow: \nConservation of mass, momentum and energy equations. Mathematical characterisation of basic equations. Dimensionless parameters in viscous flow.",
    "m2": "Module 2",
    "m2desc": "Solutions of Viscous Flow Equations: \nClassification of solutions. Couette flow, stability of Couette flow. Poiseuille steady flow through duct. Unsteady duct flow between plates with bottom injection and top suction. Plane stagnation flow- differential equation free of parameters.",
    "m3": "Module 3",
    "m3desc": "Introduction to Laminar Boundary Layer: \nLaminar boundary layer equations. Flat plate Integral analysis. Displacement thickness, Momentum and Energy thicknesses for two dimensional flows; Shape factor. Some insight into boundary layer approximations. Discussion of Navier Stokes equations. Concept of thermal boundary layer.",
    "m4": "Module 4",
    "m4desc": "Laminar Boundary Layer Equations: \nDimensionless variables. Laminar boundary layer equations. Similarity solutions for steady two-dimensional flow. Blasius solution for flat- plate flow, wall shear stress. Flat plate heat transfer for constant wall temperature. Some examples of Falkner-Skan potential flows. Reynolds analogy as a function of pressure gradient.",
    "m5": "Module 5",
    "m5desc": "Transition to Turbulence: \nStability of laminar flows - concept of small disturbance stability. Temporal instability and Spatial instability. Stability of Blasius and Falkner-Skan profiles. Effect of wall temperature. Transition to turbulence. Affecting parameters. \n\nIncompressible Turbulent Mean Flow: \nPhysical and mathematical description of turbulence. Fluctuations and time averaging. Turbulent flow in pipes and channels.  Free turbulence: - jets, wakes and mixing layers. \n\nInstrumentation and Measurements: \nHot wire and Hot film anemometer for turbulence measurements. Schlieren methods for flow visualization. Pressure probes, Interferometer and Smoke method.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
  }
]
