[
  {
    "_id": "7438",
    "subcode": "17AE82",
    "subname": "FLIGHT VEHICLE DESIGN",
    "m1": "Module 1",
    "m1desc": "Overview of Design Process: \nIntroduction, Requirements, Phases of design, Conceptual Design Process, Initial Sizing, Take-off weight build up, Empty weight estimation, Fuel fraction estimation, Take- off weight calculation. \n\nThrust to Weight Ratio & Wing Loading: \nThrust to Weight Definitions, Statistical Estimate of T/W. Thrust matching, Spread sheet in design, Wing Loading and its effect on Stall speed, Take-off Distance, Catapult take-off, and Landing Distance. Wing Loading for Cruise, Loiter, Endurance, Instantaneous Turn rate, Sustained Turn rate, Climb, & Glide, Maximum ceiling.",
    "m2": "Module 2",
    "m2desc": "Configuration Layout & loft: \nConic Lofting, Conic Fuselage Development, Conic Shape Parameter, Wing-Tail Layout & Loft. Aerofoil Linear Interpolation. Aerofoil Flat-wrap Interpolation. Wing aerofoil layout-flap wrap. Wetted area determination. Special considerations in Configuration Layout: Aerodynamic, Structural, Detectability. Crew station, Passenger, and Payload arrangements. \n\nDesign of Structural Components: \nFuselage, Wing, Horizontal & Vertical Tail. Spreadsheet for fuselage design. Tail arrangements, Horizontal & Vertical Tail Sizing. Tail Placement. Loads on Structure. V-n Diagram, Gust Envelope. Loads distribution, Shear and Bending Moment analysis.",
    "m3": "Module 3",
    "m3desc": "Engine Selection & Flight Vehicle Performance: \nTurbojet Engine Sizing, Installed Thrust Correction, Spread Sheet for Turbojet Engine Sizing. Propeller Propulsive System. Propeller design for cruise. Take-off, Landing & Enhanced Lift Devices :- Ground Roll, Rotation, Transition, Climb, Balanced Field Length, Landing Approach, Braking, Spread Sheet for Take-off and Landing. Enhanced lift design -Passive & Active. Spread Sheet.",
    "m4": "Module 4",
    "m4desc": "Static Stability & Control: \nLongitudinal Static Stability, Pitch Trim Equation. Effect of Airframe components on Static Stability. Lateral stability. Contribution of Airframe components. Directional Static stability. Contribution of Airframe components. Aileron Sizing, Rudder Sizing. Spread Sheets. Flying qualities. Cooper Harper Scale. Environmental constraints, Aerodynamic requirements.",
    "m5": "Module 5",
    "m5desc": "Design Aspects of Subsystems: \nFlight Control system, Landing Gear and subsystem, Propulsion and Fuel System Integration, Air Pressurization and Air Conditioning System, Electrical & Avionic Systems, Structural loads, Safety constraints, Material selection criteria.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
  }
]
