[
  {
    "_id": "7780",
    "subcode": "17AE833",
    "subname": "OPTIMIZATION TECHNIQUES",
    "m1": "Module 1",
    "m1desc": "Introduction: \nNon-linear programming. Mathematical fundamentals. Numerical evaluation of gradient. \n\nUnconstrained Optimisation:\nOne dimensional, single variable optimization. Maximum of a function. UnimodalFibonacci method. Polynomial based methods.",
    "m2": "Module 2",
    "m2desc": "Unconstrained Minimization:  \nMultivariable functions. Necessary and sufficient conditions for optimality. Convexity. Steepest Descent Method -Convergence Characteristics. Conjugate Gradient Method. Linear programming -Simplex Method.",
    "m3": "Module 3",
    "m3desc": "Constrained Minimization: \nNon-linear programming. Gradient based methods. Rosens`s gradient, Zoutendijk`s method, Generalised reduced gradient, Sequential quadratic programming. Sufficient condition for  optimality.",
    "m4": "Module 4",
    "m4desc": "Direct Search Methods: \nDirect search methods for nonlinear optimization. Cyclic coordinate search. Hooke and Jeeves Pattern search method. Generic algorithm. \n\nDiscrete and Dynamic Programming: \nInteger and discrete programming. Branch and bound algorithm for mixed integers. General definition of dynamic programming problem. Problem modeling and computer implementation. Shortest path problem.",
    "m5": "Module 5",
    "m5desc": "Optimisation Application: \nTransportation problem. Transportation simplex method. Network problems. Maximum flow in net works. General definition of dynamic programming. Problem modeling and computer implementation. \n\nFinite Element Based Optimisation: \nParameter optimization using gradient methods -Derivative calculation. Shape optimisation. Topology optimisation of continuum structures optimisation of continuum structures.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
  }
]
