[
  {
    "_id": "7580",
    "subcode": "17AE831",
    "subname": "FLIGHT TESTING",
    "m1": "Module 1",
    "m1desc": "Introduction: \nSequence, Planning and governing regulations of flight testing. Aircraft weight and center of gravity, flight testing tolerances. Method of reducing data uncertainty in flight test data sources and magnitudes of error, avoiding and minimizing errors. \n\nFlight test instrumentation: \nPlanning flight test instrumentation, Measurement of flight parameters. Onboard and ground based data acquisition system. Radio telemetry.",
    "m2": "Module 2",
    "m2desc": "Performance flight testing - range, endurance and climb: \nAirspeed – in flight calibration. Level flight performance for propeller driven aircraft and for Jet aircraft - Techniques and data reduction. Estimation of range, endurance and climb performance. \n\nPerformance flight testing -take-off, landing, turning flight: \nManeuvering performance estimation. Take-off and landing methods, procedures and data reduction.",
    "m3": "Module 3",
    "m3desc": "Stability and control - longitudinal and maneuvering: \nStatic & dynamic longitudinal stability: - methods of flight testing and data reduction techniques. Stick free stability methods. Maneuvering stability methods & data reduction.",
    "m4": "Module 4",
    "m4desc": "Stability and control - lateral and directional: \nLateral and directional static & dynamic stability: - Coupling between rolling and yawing moments. Steady heading slide slip. Definition of Roll stability. Adverse yaw effects. Aileron reversal. Regulations, test techniques and method of data reduction.",
    "m5": "Module 5",
    "m5desc": "Flying qualities: \nMIL and FAR regulations. Cooper-Harper scale. Pilot Rating. Flight test procedures. Hazardous flight testing: Stall and spin- regulations, test and recovery techniques. Test techniques for flutter, vibration and buffeting.",
    "descname": "Prescribed text books",
    "descdata": "",
    "notesurl": "",
    "notesscreenname": "NotesListFile",
    "notesscreenparams": "",
    "qpscreentype": "QPaperListFile",
    "qpurl": "",
    "qpscreenparams": "",
    "qbscreentype": "QBankListFile",
    "qburl": "",
    "qbscreenparams": ""
  }
]
